In [1]:
import pandas as pd

In [10]:
pd.read_excel(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\sales data.xlsx",sheet_name="Sheet1")

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Meera,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Vihaan,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Nishant,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Vihaan,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Aditi,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Riya,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Ishita,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Kabir,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Ananya,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Kabir,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [2]:
df= pd.read_excel(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\sales data.xlsx",sheet_name="Sheet1")

## 1ðŸ”¹ **Basic Operations**
| Function/Method  | Description                             |
|------------------|------------------------------------------|
| `s.head(n)`      | First `n` items                          |
| `s.tail(n)`      | Last `n` items                           |
| `s.copy()`       | Copy the Series                          |
| `s.astype(dtype)`| Convert data type                        |
| `s.drop(labels)` | Remove items by index                    |
| `s.replace(a, b)`| Replace values                           |

In [4]:
df.shape

(1000, 10)

In [5]:
df.columns

Index(['Sale_Date', 'Customer Name', 'City', 'State', 'Region',
       'Product Category', 'Product Name', 'Quantity', 'Price per Unit',
       'Sales Amount'],
      dtype='object')

In [6]:
df.head()

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Meera,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Vihaan,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Nishant,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Vihaan,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Aditi,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09

In [7]:
df.tail()

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
995,2023-04-15,Riya,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Ishita,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Kabir,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Ananya,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Kabir,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [8]:
df.sample()

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
739,2023-09-15,Ananya,Madurai,Tamil Nadu,South,Electronics,Tablet,8,2784.08,22272.64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Sale_Date         1000 non-null   datetime64[ns]
 1   Customer Name     1000 non-null   object
 2   City              1000 non-null   object
 3   State             1000 non-null   object
 4   Region            1000 non-null   object
 5   Product Category  1000 non-null   object
 6   Product Name      1000 non-null   object
 7   Quantity          1000 non-null   int64
 8   Price per Unit    1000 non-null   float64
 9   Sales Amount      1000 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(6)
memory usage: 78.3+ KB

In [15]:
df["Quantity"].astype("float")

0       6.0
1       9.0
2      11.0
3       9.0
4      17.0
       ...
995    14.0
996     6.0
997    10.0
998    15.0
999     2.0
Name: Quantity, Length: 1000, dtype: float64

In [13]:
df['Sale_Date'].astype("O")

0      2023-02-03 00:00:00
1      2023-04-21 00:00:00
2      2023-09-21 00:00:00
3      2023-08-24 00:00:00
4      2023-03-24 00:00:00
              ...
995    2023-04-15 00:00:00
996    2023-09-07 00:00:00
997    2023-04-27 00:00:00
998    2023-12-20 00:00:00
999    2023-08-16 00:00:00
Name: Sale_Date, Length: 1000, dtype: object

In [16]:
df.drop("Customer Name",axis=1)

,Sale_Date,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [17]:
df.drop(columns=["Customer Name"])

,Sale_Date,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [9]:
df.City.replace("Nagpur","Kolkata")

0         Kolkata
1      Coimbatore
2       Bengaluru
3         Madurai
4          Mumbai
          ...
995    Coimbatore
996       Kolkata
997     Bengaluru
998     Bengaluru
999        Mumbai
Name: City, Length: 1000, dtype: object

In [18]:
df

,Sale_Date,Customer Name,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Meera,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Vihaan,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Nishant,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Vihaan,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Aditi,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Riya,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Ishita,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Kabir,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Ananya,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Kabir,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [19]:
df=df.drop(columns=["Customer Name"])

In [20]:
df

,Sale_Date,City,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Nagpur,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Coimbatore,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Bengaluru,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Madurai,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Mumbai,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...,...
995,2023-04-15,Coimbatore,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Nagpur,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Bengaluru,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Bengaluru,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Mumbai,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

## 2 **Attributes**
| Attribute         | Description                      |
|------------------|----------------------------------|
| `s.index`        | Index (labels) of the Series     |
| `s.values`       | Values (data) of the Series      |
| `s.dtype`        | Data type                        |
| `s.shape`        | Shape of the Series              |
| `s.size`         | Number of elements               |
| `s.ndim`         | Number of dimensions (always 1)  |
| `s.name`         | Name of the Series               |
| `s.is_unique`    | Checks if all elements are unique|
| `s.hasnans`      | Checks for NaN values            |

---

# columns = axis=1

# row = axis=0

In [22]:
# pakka delete
df.drop('City',axis=1,inplace=True)

In [23]:
df

,Sale_Date,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...
995,2023-04-15,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [24]:
df.drop(columns=["State","Product Category",'Price per Unit'],axis=1)

     Sale_Date Region Product Name  Quantity  Sales Amount
0   2023-02-03   West        Table         6      24097.50
1   2023-04-21  South        Ruler         9      34216.65
2   2023-09-21  South        Ruler        11      39534.77
3   2023-08-24  South        Dress         9      40383.00
4   2023-03-24   West      Lentils        17      21093.09
..         ...    ...          ...       ...           ...
995 2023-04-15  South          Oil        14      63460.32
996 2023-09-07   West          Bed         6      10257.12
997 2023-04-27  South        Dress        10      38032.20
998 2023-12-20  South     Notebook        15      27795.00
999 2023-08-16   West        Pants         2       5246.86

[1000 rows x 5 columns]

In [25]:
df

,Sale_Date,State,Region,Product Category,Product Name,Quantity,Price per Unit,Sales Amount
0,2023-02-03,Maharashtra,West,Furniture,Table,6,4016.25,24097.50
1,2023-04-21,Tamil Nadu,South,Stationery,Ruler,9,3801.85,34216.65
2,2023-09-21,Karnataka,South,Stationery,Ruler,11,3594.07,39534.77
3,2023-08-24,Tamil Nadu,South,Clothing,Dress,9,4487.00,40383.00
4,2023-03-24,Maharashtra,West,Groceries,Lentils,17,1240.77,21093.09
...,...,...,...,...,...,...,...,...
995,2023-04-15,Tamil Nadu,South,Groceries,Oil,14,4532.88,63460.32
996,2023-09-07,Maharashtra,West,Furniture,Bed,6,1709.52,10257.12
997,2023-04-27,Karnataka,South,Clothing,Dress,10,3803.22,38032.20
998,2023-12-20,Karnataka,South,Stationery,Notebook,15,1853.00,27795.00
999,2023-08-16,Maharashtra,West,Clothing,Pants,2,2623.43,5246.86

In [26]:
df.drop(columns=["State","Product Category"],axis=1,inplace=True)

In [27]:
df

     Sale_Date Region Product Name  Quantity  Price per Unit  Sales Amount
0   2023-02-03   West        Table         6         4016.25      24097.50
1   2023-04-21  South        Ruler         9         3801.85      34216.65
2   2023-09-21  South        Ruler        11         3594.07      39534.77
3   2023-08-24  South        Dress         9         4487.00      40383.00
4   2023-03-24   West      Lentils        17         1240.77      21093.09
..         ...    ...          ...       ...             ...           ...
995 2023-04-15  South          Oil        14         4532.88      63460.32
996 2023-09-07   West          Bed         6         1709.52      10257.12
997 2023-04-27  South        Dress        10         3803.22      38032.20
998 2023-12-20  South     Notebook        15         1853.00      27795.00
999 2023-08-16   West        Pants         2         2623.43       5246.86

[1000 rows x 6 columns]

In [28]:
df = df.drop(columns=['Price per Unit'],axis=1)

In [29]:
df

     Sale_Date Region Product Name  Quantity  Sales Amount
0   2023-02-03   West        Table         6      24097.50
1   2023-04-21  South        Ruler         9      34216.65
2   2023-09-21  South        Ruler        11      39534.77
3   2023-08-24  South        Dress         9      40383.00
4   2023-03-24   West      Lentils        17      21093.09
..         ...    ...          ...       ...           ...
995 2023-04-15  South          Oil        14      63460.32
996 2023-09-07   West          Bed         6      10257.12
997 2023-04-27  South        Dress        10      38032.20
998 2023-12-20  South     Notebook        15      27795.00
999 2023-08-16   West        Pants         2       5246.86

[1000 rows x 5 columns]

In [31]:
df["Region"].index

RangeIndex(start=0, stop=1000, step=1)

In [32]:
df["Region"].values

array(['West', 'South', 'South', 'South', 'West', 'South', 'South',
       'West', 'South', 'South', 'West', 'South', 'West', 'West', 'West',
       'North', 'West', 'West', 'West', 'South', 'North', 'South',
       'South', 'South', 'South', 'West', 'West', 'North', 'South',
       'South', 'North', 'West', 'West', 'South', 'South', 'West',
       'South', 'North', 'South', 'West', 'South', 'West', 'North',
       'West', 'West', 'West', 'South', 'South', 'West', 'West', 'South',
       'South', 'North', 'South', 'West', 'North', 'South', 'West',
       'South', 'West', 'West', 'West', 'North', 'South', 'South', 'West',
       'North', 'South', 'South', 'West', 'North', 'West', 'South',
       'South', 'West', 'South', 'West', 'South', 'West', 'West', 'South',
       'South', 'West', 'West', 'West', 'West', 'North', 'North', 'North',
       'South', 'West', 'South', 'North', 'West', 'South', 'South',
       'West', 'South', 'North', 'North', 'South', 'South', 'West',
       'South', 'North', 'South', 'South', 'South', 'South', 'South',
       'South', 'North', 'South', 'North', 'South', 'West', 'West',
       'West', 'West', 'North', 'West', 'North', 'West', 'West', 'West',
       'West', 'South', 'North', 'South', 'North', 'South', 'West',
       'West', 'West', 'West', 'West', 'West', 'South', 'North', 'West',
       'South', 'South', 'South', 'South', 'West', 'North', 'South',
       'South', 'West', 'South', 'West', 'North', 'West', 'South',
       'South', 'West', 'North', 'West', 'South', 'South', 'South',
       'North', 'South', 'North', 'West', 'South', 'West', 'North',
       'West', 'South', 'South', 'South', 'South', 'West', 'West', 'West',
       'North', 'West', 'West', 'South', 'West', 'West', 'South', 'South',
       'South', 'West', 'North', 'North', 'South', 'South', 'West',
       'West', 'West', 'West', 'North', 'West', 'North', 'South', 'North',
       'North', 'North', 'West', 'West', 'West', 'West', 'South', 'West',
       'West', 'West', 'South', 'West', 'South', 'West', 'West', 'North',
       'West', 'North', 'North', 'South', 'South', 'North', 'West',
       'South', 'South', 'North', 'West', 'West', 'South', 'South',
       'West', 'North', 'North', 'West', 'North', 'West', 'West', 'South',
       'South', 'West', 'South', 'South', 'South', 'West', 'North',
       'South', 'North', 'West', 'West', 'North', 'South', 'South',
       'South', 'North', 'South', 'South', 'West', 'North', 'South',
       'West', 'South', 'West', 'South', 'North', 'South', 'West', 'West',
       'West', 'West', 'West', 'South', 'West', 'North', 'South', 'West',
       'South', 'North', 'South', 'West', 'West', 'South', 'South',
       'West', 'South', 'West', 'South', 'West', 'South', 'West', 'North',
       'South', 'South', 'North', 'West', 'West', 'South', 'West', 'West',
       'West', 'South', 'West', 'North', 'West', 'West', 'South', 'North',
       'South', 'West', 'North', 'South', 'South', 'South', 'South',
       'North', 'South', 'North', 'South', 'West', 'West', 'West',
       'South', 'West', 'West', 'West', 'South', 'West', 'South', 'South',
       'North', 'West', 'West', 'West', 'South', 'South', 'North',
       'South', 'South', 'North', 'South', 'South', 'North', 'West',
       'West', 'South', 'South', 'North', 'South', 'South', 'West',
       'South', 'North', 'South', 'South', 'West', 'South', 'South',
       'West', 'West', 'South', 'South', 'South', 'West', 'South',
       'South', 'West', 'West', 'West', 'South', 'South', 'West', 'West',
       'South', 'West', 'South', 'North', 'South', 'West', 'South',
       'North', 'South', 'South', 'North', 'North', 'South', 'West',
       'North', 'West', 'South', 'South', 'South', 'North', 'West',
       'West', 'South', 'West', 'West', 'West', 'West', 'South', 'North',
       'South', 'North', 'South', 'South', 'South', 'North', 'South',
       'West', 'South', 'South', 'West', 'West', 'North', 'West', 'South',
       'West', 'North', 'West', 'South', 'South', 'North', 'West',
       'South', 'West', 'North', 'West', 'South', 'South', 'South',
       'West', 'South', 'West', 'South', 'South', 'South', 'South',
       'South', 'South', 'West', 'North', 'South', 'West', 'West', 'West',
       'South', 'West', 'South', 'West', 'South', 'West', 'West', 'South',
       'North', 'North', 'West', 'West', 'West', 'South', 'North', 'West',
       'West', 'North', 'North', 'South', 'North', 'South', 'North',
       'South', 'South', 'South', 'South', 'West', 'North', 'West',
       'North', 'West', 'West', 'West', 'South', 'West', 'West', 'South',
       'West', 'South', 'South', 'West', 'North', 'West', 'West', 'North',
       'North', 'West', 'South', 'North', 'North', 'West', 'North',
       'North', 'West', 'North', 'South', 'West', 'West', 'South', 'West',
       'West', 'West', 'South', 'North', 'West', 'North', 'West', 'North',
       'South', 'North', 'North', 'West', 'South', 'South', 'West',
       'South', 'West', 'West', 'South', 'West', 'South', 'West', 'North',
       'South', 'South', 'North', 'West', 'South', 'South', 'South',
       'South', 'West', 'North', 'South', 'West', 'South', 'West',
       'South', 'North', 'North', 'West', 'West', 'West', 'North', 'West',
       'West', 'North', 'South', 'West', 'West', 'West', 'North', 'South',
       'South', 'North', 'North', 'South', 'West', 'North', 'West',
       'South', 'West', 'North', 'West', 'West', 'South', 'North',
       'South', 'South', 'South', 'South', 'West', 'South', 'West',
       'South', 'West', 'South', 'South', 'South', 'West', 'North',
       'South', 'West', 'West', 'South', 'West', 'South', 'South',
       'South', 'West', 'South', 'West', 'West', 'West', 'West', 'South',
       'West', 'South', 'West', 'West', 'South', 'West', 'West', 'South',
       'West', 'South', 'West', 'West', 'South', 'West', 'North', 'South',
       'West', 'West', 'South', 'West', 'West', 'South', 'South', 'South',
       'South', 'West', 'North', 'West', 'South', 'South', 'South',
       'South', 'South', 'South', 'West', 'West', 'South', 'South',
       'South', 'West', 'North', 'West', 'South', 'South', 'West',
       'South', 'North', 'South', 'South', 'West', 'West', 'West',
       'North', 'South', 'North', 'West', 'South', 'South', 'South',
       'West', 'South', 'North', 'West', 'West', 'South', 'South',
       'North', 'West', 'West', 'West', 'North', 'South', 'West', 'West',
       'North', 'South', 'South', 'West', 'South', 'West', 'South',
       'West', 'West', 'South', 'West', 'South', 'South', 'West', 'West',
       'South', 'West', 'South', 'West', 'South', 'South', 'West', 'West',
       'North', 'South', 'West', 'West', 'North', 'South', 'South',
       'West', 'West', 'West', 'South', 'South', 'South', 'West', 'West',
       'South', 'West', 'South', 'West', 'South', 'West', 'West', 'North',
       'West', 'South', 'North', 'North', 'North', 'South', 'West',
       'South', 'South', 'North', 'South', 'South', 'West', 'West',
       'North', 'West', 'North', 'West', 'South', 'South', 'South',
       'South', 'West', 'West', 'North', 'South', 'North', 'South',
       'West', 'South', 'West', 'West', 'North', 'West', 'North', 'West',
       'North', 'North', 'South', 'West', 'South', 'West', 'South',
       'West', 'West', 'North', 'West', 'West', 'South', 'South', 'South',
       'South', 'South', 'North', 'West', 'North', 'West', 'South',
       'South', 'West', 'West', 'North', 'North', 'South', 'South',
       'South', 'South', 'West', 'West', 'West', 'West', 'South', 'South',
       'South', 'North', 'West', 'South', 'North', 'West', 'West',
       'North', 'South', 'South', 'South', 'South', 'West', 'West',
       'South', 'North', 'South', 'West', 'South', 'North', 'South',
       'North', 'North', 'West', 'West', 'West', 'North', 'South', 'West',
       'West', 'South', 'South', 'West', 'South', 'South', 'North',
       'West', 'North', 'West', 'South', 'South', 'South', 'West',
       'South', 'South', 'West', 'West', 'South', 'South', 'North',
       'West', 'West', 'North', 'West', 'South', 'West', 'South', 'West',
       'West', 'West', 'West', 'South', 'South', 'South', 'West', 'West',
       'North', 'West', 'South', 'North', 'South', 'South', 'West',
       'West', 'South', 'South', 'West', 'South', 'South', 'South',
       'North', 'South', 'South', 'North', 'South', 'South', 'West',
       'South', 'West', 'West', 'West', 'South', 'North', 'South', 'West',
       'South', 'South', 'South', 'South', 'South', 'North', 'South',
       'South', 'North', 'West', 'South', 'South', 'North', 'West',
       'North', 'North', 'North', 'West', 'South', 'South', 'South',
       'West', 'South', 'North', 'West', 'West', 'North', 'South',
       'South', 'West', 'North', 'West', 'North', 'West', 'South', 'West',
       'South', 'West', 'West', 'North', 'South', 'North', 'South',
       'South', 'West', 'South', 'South', 'South', 'North', 'South',
       'South', 'South', 'North', 'South', 'South', 'West', 'South',
       'South', 'South', 'West', 'North', 'West', 'West', 'West', 'West',
       'West', 'South', 'South', 'North', 'South', 'South', 'North',
       'West', 'West', 'North', 'South', 'South', 'West', 'North', 'West',
       'South', 'North', 'South', 'North', 'North', 'South', 'North',
       'West', 'West', 'South', 'South', 'North', 'South', 'South',
       'North', 'South', 'West', 'North', 'South', 'North', 'West',
       'West', 'South', 'South', 'South', 'North', 'South', 'South',
       'West', 'South', 'South', 'West'], dtype=object)

In [33]:
df["Region"].dtype

dtype('O')

In [34]:
df["Region"].is_unique

False

In [35]:
df["Region"].unique()

array(['West', 'South', 'North'], dtype=object)

In [36]:
df["Region"].size

1000

In [37]:
df["Region"].ndim

1

In [39]:
df["Region"].hasnans

False

In [41]:
df.isna().sum()

Sale_Date       0
Region          0
Product Name    0
Quantity        0
Sales Amount    0
dtype: int64

## 3. **Logical/Boolean**
| Method             | Description                          |
|--------------------|--------------------------------------|
| `s.isnull()`       | Detect missing values (NaN)          |
| `s.notnull()`      | Opposite of `isnull()`               |
| `s.any()`          | If any True                          |
| `s.all()`          | If all True                          |
| `s.where(cond)`    | Keep values where condition is True  |
| `s.mask(cond)`     | Mask values where condition is True  |

In [33]:
data= pd.read_csv(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\Titanic-Dataset (2).csv")

In [43]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [44]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [46]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [47]:
data.isna().mean()*100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [25]:
data['Fare'][data["Fare"]==0]

179    0.0
263    0.0
271    0.0
277    0.0
302    0.0
413    0.0
466    0.0
481    0.0
597    0.0
633    0.0
674    0.0
732    0.0
806    0.0
815    0.0
822    0.0
Name: Fare, dtype: float64

In [23]:
age = data['Age'][data["Age"]<1]
age

78     0.83
305    0.92
469    0.75
644    0.75
755    0.67
803    0.42
831    0.83
Name: Age, dtype: float64

In [20]:
x=data['Age'].where(data['Age']>1,1)
x

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     1.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [27]:
data['Survived'].where(data["Survived"]==1,"No")

0      No
1       1
2       1
3       1
4      No
       ..
886    No
887     1
888    No
889     1
890    No
Name: Survived, Length: 891, dtype: object

In [29]:
data['Survived'].mask(data["Survived"]==1,"No")

0       0
1      No
2      No
3      No
4       0
       ..
886     0
887    No
888     0
889    No
890     0
Name: Survived, Length: 891, dtype: object

## 4. **Sorting & Ranking**
| Method              | Description                     |
|---------------------|---------------------------------|
| `s.sort_values()`   | Sort by values                  |
| `s.sort_index()`    | Sort by index                   |
| `s.rank()`          | Rank of each element            |

In [30]:
data['Survived'].unique()

array([0, 1])

In [32]:
data['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [34]:
data['Age'].sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: Age, Length: 891, dtype: float64

In [37]:
Age = data['Age'].sort_values(ascending=False)
Age

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: Age, Length: 891, dtype: float64

In [38]:
Age.sort_index()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [40]:
Age = data['Age'].sort_values()
Age.rank()

803    1.0
755    2.0
644    3.5
469    3.5
78     5.5
      ...
859    NaN
863    NaN
868    NaN
878    NaN
888    NaN
Name: Age, Length: 891, dtype: float64

In [42]:
data['Embarked'].value_counts().rank()

Embarked
S    3.0
C    2.0
Q    1.0
Name: count, dtype: float64

## 5. **Aggregation**
| Method              | Description                     |
|---------------------|---------------------------------|
| `s.count()`         | Count non-null values           |
| `s.describe()`      | Summary statistics              |
| `s.value_counts()`  | Frequency of unique values      |
| `s.unique()`        | Unique values                   |
| `s.nunique()`       | Number of unique values         |

In [43]:
data['Age'].count()

np.int64(714)

In [48]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [54]:
data.describe(include="O")
# data.describe(include="object")

                       Name   Sex  Ticket Cabin Embarked
count                   891   891     891   204      889
unique                  891     2     681   147        3
top     Dooley, Mr. Patrick  male  347082    G6        S
freq                      1   577       7     4      644

In [44]:
data['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [46]:
data['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [47]:
data['Embarked'].nunique()

3

# 6. **Indexing and Selection**
| Method            | Description                          |
|-------------------|--------------------------------------|
| `s[0]`, `s['a']`  | Access by position or label          |
| `s.loc['a']`      | Label-based selection                |
| `s.iloc[0]`       | Position-based selection             |
| `s.at['a']`       | Fast label access                    |
| `s.iat[0]`        | Fast position access                 |
| `s.get(key)`      | Safe getter                          |

---
- **loc:**
It selects data by labels (row and column names). It can handle single labels, lists of labels, and slices with labels.
- **iloc:**
It selects data by integer positions (row and column indices). It also accepts single integers, lists of integers, and slices with integers.
- **at:**
It accesses a single value by label. It is optimized for speed when accessing individual elements.
- **iat:**
It accesses a single value by integer position. Similar to at, it is optimized for fast access to scalar values.

## 7 **Math & Stats**
| Method            | Description                          |
|-------------------|--------------------------------------|
| `s.sum()`         | Sum of elements                      |
| `s.mean()`        | Average                              |
| `s.median()`      | Median                               |
| `s.mode()`        | Most frequent value(s)               |
| `s.min()`         | Minimum                              |
| `s.max()`         | Maximum                              |
| `s.std()`         | Standard deviation                   |
| `s.var()`         | Variance                             |
| `s.cumsum()`      | Cumulative sum                       |
| `s.cumprod()`     | Cumulative product                   |
| `s.abs()`         | Absolute values                      |
| `s.round(n)`      | Round to `n` decimal places          |

## 8 **String Operations** (if Series contains strings)
| Method                 | Example                       |
|------------------------|-------------------------------|
| `s.str.lower()`        | Convert to lowercase          |
| `s.str.upper()`        | Convert to uppercase          |
| `s.str.contains('x')`  | Check if contains 'x'         |
| `s.str.replace('a','b')`| Replace 'a' with 'b'         |
| `s.str.strip()`        | Remove whitespace             |
| `s.str.len()`          | Length of each string         |

## 9 **Date/Time Functions** (if Series is datetime)
| Method               | Description                    |
|----------------------|--------------------------------|
| `s.dt.year`          | Extract year                   |
| `s.dt.month`         | Extract month                  |
| `s.dt.day`           | Extract day                    |
| `s.dt.weekday`       | Day of week (0=Mon)            |
| `s.dt.strftime()`    | Format dates as string         |

## 10 **Other Useful Methods**
| Method                  | Description                   |
|--------------------------|-------------------------------|
| `s.duplicated()`        | Detect duplicate values        |
| `s.between(a, b)`       | Values between a and b         |
| `s.add()`, `s.sub()`     | Add or subtract series         |
| `s.clip(lower, upper)` | Limit values to a range        |
| `s.apply(func)`         | Apply a function element-wise  |
| `s.map(func/dict)`      | Map values using function/dict |